In [113]:
import pandas as pd 
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns

In a new cell type: %matplotlib inline. This will make your plots show in the notebook without having to call plt.show() every time. Helpful down the road!

In [114]:
%matplotlib inline

Using the pandas read_csv() function, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.

In [115]:
gdp_df = pd.read_csv("..\data\gdp_percapita.csv",nrows=6729)
gdp_df.iloc[:6]

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

Read in internet_use required clean up to exclude the bad lines with 'error_bad_lines=False' and then remove footnotes using iloc to identify where they started (row 4495 is the last row of data so nrows=4495 reduced to that ending row)

In [116]:
#internet_df = pd.read_csv("..\data\internet_use.csv",error_bad_lines=False)
internet_df = pd.read_csv("..\data\internet_use.csv",nrows=4495)
#internet_df.iloc[4494]
internet_df.iloc[:6]

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

Look at the shape of each dataframe - how many rows, how many columns.

In [117]:
gdp_df.shape

(6729, 4)

In [118]:
internet_df.shape

(4495, 4)

Take a look at the data types for the columns in each table.

In [119]:
print(gdp_df.dtypes)

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [120]:
print(internet_df.dtypes)

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

Take a look at the last 10 rows of each dataset in turn.

In [121]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [122]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

Drop the 'value footnotes' data from both datasets. Check that this worked as expected.
COMMENT: df = df[df.columns.drop(col_to_drop)] didn't work but dropna(axis=1) did work and adding axis=1 fixes the other

In [123]:
# column_to_drop = ['Value Footnotes']
# gdp_df = gdp_df[gdp_df.drop(column_to_drop)]
gdp_df = gdp_df.dropna(axis = 1)
gdp_df.head()

  Country or Area  Year        Value
0     Afghanistan  2018  1734.723214
1     Afghanistan  2017  1758.465636
2     Afghanistan  2016  1757.023490
3     Afghanistan  2015  1766.593077
4     Afghanistan  2014  1795.735834

In [124]:
internet_df = internet_df.drop(columns=["Value Footnotes"],axis=1)

In [125]:
internet_df.head()

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [129]:
gdp_df = gdp_df.rename(columns={"Country or Area":"Country", "Value": "GDP_Per_Capita"})
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636
2  Afghanistan  2016     1757.023490
3  Afghanistan  2015     1766.593077
4  Afghanistan  2014     1795.735834

Change the columns for the Internet Users data frame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [130]:
internet_df = internet_df.rename(columns={"Country or Area":"Country", "Value": "Internet_Users_Pct"})
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. 
Call the new DataFrame gdp_and_internet_use.
Look at the first five rows of your new data frame to confirm the columns are how you expect.

In [137]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, on=['Country','Year'],how='outer')
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

Look at the last five rows to make sure the data is clean and as expected.

In [139]:
gdp_and_internet_use.tail(10)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7695  Virgin Islands (U.S.)  2002             NaN           27.494432
7696  Virgin Islands (U.S.)  2001             NaN           18.375766
7697  Virgin Islands (U.S.)  2000             NaN           13.815081
7698  Virgin Islands (U.S.)  1999             NaN           11.074606
7699  Virgin Islands (U.S.)  1998             NaN            9.245220
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

Look at the shape of the new dataset. Were any rows dropped?

In [140]:
gdp_and_internet_use.shape

(7705, 4)

Subset the combined data frame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [144]:
subset = gdp_and_internet_use[gdp_and_internet_use["Year"].isin([2004, 2009, 2014])]
subset.shape

(835, 4)

Create three new data frames, one for 2004, one for 2009, and one for 2014. 
Give them meaningful names that aren't too long.

In [145]:
gdp_internet_2004 = gdp_and_internet_use[gdp_and_internet_use["Year"].isin([2004])]
gdp_internet_2004.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
14           Afghanistan  2004     1025.208245            0.105809
31               Albania  2004     7001.054082            2.420388
60               Algeria  2004    11845.170512            4.634475
89                Angola  2004     4604.657044            0.464815
118  Antigua and Barbuda  2004    21161.123532           24.266544

In [146]:
gdp_internet_2009 = gdp_and_internet_use[gdp_and_internet_use["Year"].isin([2009])]
gdp_internet_2009.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
9            Afghanistan  2009     1502.354073                3.55
26               Albania  2009     9525.377979               41.20
55               Algeria  2009    12697.690780               11.23
84                Angola  2009     6292.534856                6.00
113  Antigua and Barbuda  2009    22568.626530               42.00

In [147]:
gdp_internet_2014 = gdp_and_internet_use[gdp_and_internet_use["Year"].isin([2014])]
gdp_internet_2014.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
4            Afghanistan  2014     1795.735834                6.39
21               Albania  2014    10700.993216               60.10
50               Algeria  2014    13557.769757               18.09
79                Angola  2014     6813.052106               21.26
108  Antigua and Barbuda  2014    20440.540555               64.00

Which country had the highest percentage of internet users in 2014? What was the percentage? Repeat for 2004 and 2009. 
(Try typing the first 3 letters of your DataFrame name and hitting the tab for auto-complete options).

In [160]:
gdp_internet_2004.idxmax
#gdp_internet_2004.max(level="Internet_Users_Pct")
#print(gdp_internet_2004.dtypes)

<bound method DataFrame.idxmax of                           Country  Year  GDP_Per_Capita  Internet_Users_Pct
14                    Afghanistan  2004     1025.208245            0.105809
31                        Albania  2004     7001.054082            2.420388
60                        Algeria  2004    11845.170512            4.634475
89                         Angola  2004     4604.657044            0.464815
118           Antigua and Barbuda  2004    21161.123532           24.266544
147                    Arab World  2004    12658.060443                 NaN
176                     Argentina  2004    14498.772332           16.036684
205                       Armenia  2004     4673.816503            4.899009
233                         Aruba  2004    39553.374074           23.000000
262                     Australia  2004    38260.380995                 NaN
291                       Austria  2004    40652.811067           54.280000
320                    Azerbaijan  2004     6460.055025                 NaN
349                       Bahrain  2004    43355.738118           21.458681
378                    Bangladesh  2004     1896.763311            0.199036
407                      Barbados  2004    16093.593548           49.800000
436                       Belarus  2004    10195.510821                 NaN
465                       Belgium  2004    38719.537943           53.860000
494                        Belize  2004     7719.054755            9.800000
523                         Benin  2004     1757.902979            1.182541
547                       Bermuda  2004    55452.638880           60.990867
576                        Bhutan  2004     4191.892889            3.156984
605                       Bolivia  2004     4524.069812            4.439925
634        Bosnia and Herzegovina  2004     7689.141198           15.468972
659                      Botswana  2004    11399.444315            3.304889
688                        Brazil  2004    12106.286498           19.073672
717                        Brunei  2004    83963.238066                 NaN
746                      Bulgaria  2004    11507.041777           18.130000
775                  Burkina Faso  2004     1200.417062            0.400295
804                       Burundi  2004      708.833720            0.349060
833                CÃ´te d'Ivoire  2004     2690.738762                 NaN
...                           ...   ...             ...                 ...
6988               Dominican Rep.  2004             NaN            8.865553
7015                Faroe Islands  2004             NaN           66.533599
7031                French Guiana  2004             NaN           19.498379
7051             French Polynesia  2004             NaN           17.884537
7071                       Gambia  2004             NaN            3.308003
7090                    Gibraltar  2004             NaN           32.886083
7109                    Greenland  2004             NaN           56.099015
7149                         Guam  2004             NaN           36.161788
7164                     Guernsey  2004             NaN           64.516129
7184             Hong Kong, China  2004             NaN           56.399880
7210       Iran (Islamic Rep. of)  2004             NaN            7.490000
7227                       Jersey  2004             NaN           30.681818
7247              Korea (Rep. of)  2004             NaN           72.700000
7275                   Kyrgyzstan  2004             NaN            5.090385
7293                   Lao P.D.R.  2004             NaN            0.361434
7317                Liechtenstein  2004             NaN           64.007448
7334                 Macao, China  2004             NaN           31.484097
7379  Micronesia (Fed. States of)  2004             NaN           11.017867
7401                       Monaco  2004             NaN           52.490197
7423                New Caledonia  2004             NaN           30.298046
7446                    Palestine  2004             NaN            4.400905
7468        Saint Kitts and Nevis  2004             NaN           24.737678
7488                  Saint Lucia  2004             NaN           21.395212
7512        Sao Tome and Principe  2004             NaN           13.322853
7530                      Somalia  2004             NaN            1.053455
7551                    Swaziland  2004             NaN            3.228685
7572                        Syria  2004             NaN            4.321594
7615           T.F.Y.R. Macedonia  2004             NaN           24.440000
7673                     Viet Nam  2004             NaN            7.642409
7693        Virgin Islands (U.S.)  2004             NaN           27.377009

[278 rows x 4 columns]>